[
    {
      "id": 1,
      "chefPicture": "https://i.ibb.co/Ctz5Z7w/chef2.jpg",
      "chefName": "John Smith",
      "yearsOfExperience": 10,
      "numberOfRecipes": 20,
      "likes": 1500,
      "description": "A talented culinary expert with a passion for creating delicious and visually stunning dishes. John has 10 years of experience, crafting a collection of 20 amazing recipes that have garnered 1500 likes from food enthusiasts."
    },
    {
      "id": 2,
      "chefPicture": "https://i.ibb.co/fn8myjk/chef1.jpg",
      "chefName": "Sarah Johnson",
      "yearsOfExperience": 8,
      "numberOfRecipes": 15,
      "likes": 1200,
      "description": "Sarah is known for her exceptional culinary skills and innovative approach to cooking. With 8 years of experience, she has crafted 15 outstanding recipes that have received 1200 likes, captivating the taste buds of many."
    },
    {
      "id": 3,
      "chefPicture": "https://i.ibb.co/pf16gQT/chef3.jpg",
      "chefName": "Michael Davis",
      "yearsOfExperience": 15,
      "numberOfRecipes": 25,
      "likes": 2000,
      "description": "Michael is a seasoned chef with 15 years of culinary expertise. He delights in creating extraordinary dishes and has curated a collection of 25 remarkable recipes that have earned 2000 likes."
    },
    {
      "id": 4,
      "chefPicture": "https://i.ibb.co/9w3GMMt/chef4.jpg",
      "chefName": "Emily Thompson",
      "yearsOfExperience": 12,
      "numberOfRecipes": 18,
      "likes": 1700,
      "description": "Emily is a skilled chef who brings creativity and passion to her cooking. With 12 years of experience, she has developed 18 exceptional recipes that have garnered 1700 likes from food enthusiasts."
    },
    {
      "id": 5,
      "chefPicture": "https://i.ibb.co/vsPydn9/chef5.jpg",
      "chefName": "David Wilson",
      "yearsOfExperience": 6,
      "numberOfRecipes": 10,
      "likes": 900,
      "description": "David is a talented chef with a flair for creating unique and flavorful dishes. Despite his 6 years of experience, he has already crafted an impressive collection of 10 delicious recipes that have received 900 likes."
    },
    {
      "id": 6,
      "chefPicture": "https://i.ibb.co/Kqy9cQ9/chef6.jpg",
      "chefName": "James Anderson",
      "yearsOfExperience": 9,
      "numberOfRecipes": 14,
      "likes": 1100,
      "description": "James is a skilled chef known for his culinary expertise and attention to detail. With 9 years of experience, he has curated a collection of 14 exceptional recipes that have garnered 1100 likes from food enthusiasts."
    }
  ]
  